sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
// Private helper functions.
// These may or may not be present in all applications.
static void InitAppConfig(void);
static void InitializeBoard(void);
static void ProcessIO(void);
void FanControl();

#if defined(WF_CS_TRIS)
    static void WF_Connect(void);
#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
{
    //while(1){
        Nop();
        Nop();
    //}
}
void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
{
    while(1){
        Nop();
        Nop();
    }
}
void _ISR __attribute__((__no_auto_psv__)) _MathError(void)
{
    while(1){
        Nop();
        Nop();
    }
}  
void _ISR __attribute__((__no_auto_psv__)) _OscillatorFail(void)
{
    while(1){
        Nop();
        Nop();
    }
}   
void _ISR __attribute__((__no_auto_psv__)) _DMACError(void)
{
    while(1){
        Nop();
        Nop();
    }
}  
#if defined(__C32__)
    void _general_exception_handler(unsigned cause, unsigned status)
    {
        Nop();
        Nop();
    }
#endif

int Tmr7CallBack(void)
{
    DWORD_VAL C;
    T8CONbits.TON = 0;
    T7CONbits.TON = 0;
    C.word.LW = TMR8;
    C.word.HW = TMR9;
    CPUSPEED.Val = C.Val / 2;
    return 0;
}
//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{  
        
    static DWORD t = 0;
    static DWORD dwLastIP = 0;

    // Initialize application specific hardware
    // Для работы A13  его нужно отключить от ADC
    {
        TRISAbits.TRISA12 = 1;
        AD1CON1 = 0;
        AD2CON1 = 0;
        AD1PCFGH = 0xFFFF;
        AD1PCFGL = 0xFFFF;
        AD2PCFGL = 0xFFFF;
    }

  
    InitializeBoard();
    CPUSPEED.Val = 0;
    // calculate CPU speed  
    T7CONbits.TON = 0;
    T8CONbits.TON = 0;
    T9CONbits.TON = 0;
    TimerInit(TIMER8, CLOCK_SOURCE_INTERNAL, GATED_DISABLE, PRE_1_1, IDLE_DISABLE, BIT_32, SYNC_DISABLE);
    TimerInit(TIMER7, CLOCK_SOURCE_EXTERNAL, GATED_DISABLE, PRE_1_1, IDLE_DISABLE, BIT_16, SYNC_DISABLE);
    TimerSetValue(TIMER7, 0x0000, 0xFFFF); 
    TimerSetValue(TIMER8, 0x0000, 0xFFFF);
    TimerSetValue(TIMER9, 0x0000, 0xFFFF);
    TimerSetCallback(TIMER7, Tmr7CallBack);
    TimerSetInt(TIMER7, 7, TRUE);
    T7CONbits.TON = 1;
    T8CONbits.TON = 1;
    
#if defined(USE_LCD)
    // Initialize and display the stack version on the LCD
    LCDInit();
    DelayMs(100);
    strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
        "                ");
    LCDUpdate();
#endif

    // Initialize stack-related hardware components that may be 
    // required by the UART configuration routines
    TickInit();
#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
    MPFSInit();
#endif

    // Initialize Stack and application related NV variables into AppConfig.
    InitAppConfig();
    Cmd_Init();

    // Initiates board setup process if button is depressed 
    // on startup
    #ifdef bad
    if(BUTTON0_IO == 0u)
    {
    #if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
    // Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
    DWORD StartTime = TickGet();
    LED_PUT(0x00);
            
    while(BUTTON0_IO == 0u)
    {
        if(TickGet() - StartTime > 4*TICK_SECOND)
        {
            #if defined(EEPROM_CS_TRIS)
            XEEBeginWrite(0x0000);
            XEEWrite(0xFF);
            XEEWrite(0xFF);
            XEEEndWrite();
            #elif defined(SPIFLASH_CS_TRIS)
            SPIFlashBeginWrite(0x0000);
            SPIFlashWrite(0xFF);
            SPIFlashWrite(0xFF);
            #endif
            
            #if defined(STACK_USE_UART)
            putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
            #endif

            LED_PUT(0x0F);
            while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
            LED_PUT(0x00);
            while(BUTTON0_IO == 0u);
            Reset();
            break;
        }
    }
    #endif

    #if defined(STACK_USE_UART)
        DoUARTConfig();
    #endif
    }
    #endif //bad
    // Initialize core stack layers (MAC, ARP, TCP, UDP) and
    // application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(WF_CS_TRIS)
    WF_Connect();
    #endif

    // Initialize any application-specific modules or functions/
    // For this demo application, this only includes the
    // UART 2 TCP Bridge
    #if defined(STACK_USE_UART2TCP_BRIDGE)
    UART2TCPBridgeInit();
    #endif

    #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
    ZeroconfLLInitialize();
    #endif

    #if defined(STACK_USE_ZEROCONF_MDNS_SD)
    mDNSInitialize(MY_DEFAULT_HOST_NAME);
    mDNSServiceRegister(
        (const char *) "DemoWebServer",    // base name of the service
        "_http._tcp.local",                // type of the service
        80,                                // TCP or UDP port, at which this service is available
        ((const BYTE *)"path=/index.htm"),    // TXT info
        1,                                    // auto rename the service when if needed
        NULL,                                // no callback function
        NULL                                // no application context
        );

    mDNSMulticastFilterRegister();            
    #endif

     //Вентиляторы        
    /*{
        TRISBbits.TRISB4 = 0;
        T7CON = 0x0030; //0.000000025*256 = 0.0000064
        TMR7 = 0x0000;
        PR7 = 16384;//512;
        IFS3bits.T7IF = 0;
        IEC3bits.T7IE = 1;
        IPC12bits.T7IP = 4;    
        T7CONbits.TON = 1;
    } */
    // OCSetup();
    // Now that all items are initialized, begin the co-operative
    // multitasking loop.  This infinite loop will continuously 
    // execute all stack-related tasks, as well as your own
    // application's functions.  Custom functions should be added
    // at the end of this loop.
    // Note that this is a "co-operative mult-tasking" mechanism
    // where every task performs its tasks (whether all in one shot
    // or part of it) and returns so that other tasks can do their
    // job.
    // If a task needs very long time to do its job, it must be broken
    // down into smaller pieces so that other tasks can have CPU time.
    while(1)
    {
        
        //Control(&rr1);
        //Control(&rr2);
        //Control(&rr3);
        // Blink LED0 (right most one) every second.
        
        //if(TickGet() - d >= TICK_SECOND/16000ul)
        //{
        //    d = TickGet();
        //       LATDbits.LATD0 ^= 1; // выход STEP
            
        //}
        //TimerMonitor();
        //FanControl();        
        if(PORTAbits.RA13 != t){
            t = PORTAbits.RA13;
                //LED0_IO = t;
                //if(!TimeAdjusted){
                //    TimeAdjusted = AdjustLocalRTCTime(); 
                //    LED2_IO = TimeAdjusted;           
                //}
                //RRConfigRAM.RRSave[0].XPosition = rr1.XPosition;
                //RRConfigRAM.RRSave[1].XPosition = rr2.XPosition;                
                //   RRConfigRAM.RRSave[2].XPosition = rr3.XPosition;
                //SaveRRConfig();
        }
        // This task performs normal stack task including checking
        // for incoming packet, type of packet and calling
        // appropriate stack entity to process it.
        StackTask();
        //SPI_RTCReadTime(&Time);
        //SPI_RTCReadRegister(00, &Second);
        // This tasks invokes each of the core stack application tasks
        StackApplications();
        Cmd_Process();

        #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
        ZeroconfLLProcess();
        #endif

        #if defined(STACK_USE_ZEROCONF_MDNS_SD)
        mDNSProcess();
    // Use this function to exercise service update function
    // HTTPUpdateRecord();
        #endif

    // Process application specific tasks here.
    // For this demo app, this will include the Generic TCP 
    // client and servers, and the SNMP, Ping, and SNMP Trap
    // demos.  Following that, we will process any IO from
    // the inputs on the board itself.
    // Any custom modules or processing you need to do should
    // go here.
    #if defined(STACK_USE_GENERIC_TCP_CLIENT_EXAMPLE)
    GenericTCPClient();
    #endif
    
    #if defined(STACK_USE_GENERIC_TCP_SERVER_EXAMPLE)
    GenericTCPServer();
    #endif
    
    #if defined(STACK_USE_SMTP_CLIENT)
    SMTPDemo();
    #endif
    
    #if defined(STACK_USE_ICMP_CLIENT)
    PingDemo();
    #endif
    
    #if defined(STACK_USE_SNMP_SERVER) && !defined(SNMP_TRAP_DISABLED)
    //User should use one of the following SNMP demo
    // This routine demonstrates V1 or V2 trap formats with one variable binding.
    SNMPTrapDemo();
    
    #if defined(SNMP_STACK_USE_V2_TRAP) || defined(SNMP_V1_V2_TRAP_WITH_SNMPV3)
    //This routine provides V2 format notifications with multiple (3) variable bindings
    //User should modify this routine to send v2 trap format notifications with the required varbinds.
    //SNMPV2TrapDemo();
    #endif 
    if(gSendTrapFlag)
        SNMPSendTrap();
    #endif
    
    #if defined(STACK_USE_BERKELEY_API)
    //BerkeleyTCPClientDemo();
        BerkeleyTCPServerDemo();
    //BerkeleyUDPClientDemo();
    #endif

    ProcessIO();

        // If the local IP address has changed (ex: due to DHCP lease change)
        // write the new IP address to the LCD display, UART, and Announce 
        // service
    if(dwLastIP != AppConfig.MyIPAddr.Val)
    {
        dwLastIP = AppConfig.MyIPAddr.Val;
            
        #if defined(STACK_USE_UART)
            putrsUART((ROM char*)"\r\nNew IP Address: ");
        #endif

